pcorona182/Pic18F-and-C-/Monofasico.X/main.c

#define FCY 20000000
#define TCY 20000000
#define _XTAL_FREQ 20000000
/** INCLUDES *******************************************************/
#include "usb.h"
#include "usb_function_cdc.h"
#include "HardwareProfile.h"

/** CONFIGURATION **************************************************/

        #pragma config PLLDIV   = 5         // (20 MHz crystal on PICDEM FS USB board)
        #if (USB_SPEED_OPTION == USB_FULL_SPEED)
            #pragma config CPUDIV   = OSC1_PLL2
        #else
            #pragma config CPUDIV   = OSC3_PLL4
        #endif
        
        #pragma config USBDIV   = 2         // Clock source from 96MHz PLL/2
        //#pragma config FOSC     = HSPLL_HS
        #pragma config FOSC     = HSPLL_HS
        #pragma config FCMEN    = OFF
        #pragma config IESO     = OFF
        #pragma config PWRT     = OFF
        #pragma config BOR      = ON
        #pragma config BORV     = 3
        #pragma config VREGEN   = ON      //USB Voltage Regulator
        #pragma config WDT      = OFF
        #pragma config WDTPS    = 32768
        #pragma config MCLRE    = OFF
        #pragma config LPT1OSC  = OFF
        #pragma config PBADEN   = OFF
//      #pragma config CCP2MX   = ON
        #pragma config STVREN   = ON
        #pragma config LVP      = OFF
//      #pragma config ICPRT    = OFF       // Dedicated In-Circuit Debug/Programming
        #pragma config XINST    = OFF       // Extended Instruction Set
        #pragma config CP0      = OFF
        #pragma config CP1      = OFF
//      #pragma config CP2      = OFF
//      #pragma config CP3      = OFF
        #pragma config CPB      = OFF
//      #pragma config CPD      = OFF
        #pragma config WRT0     = OFF
        #pragma config WRT1     = OFF
//      #pragma config WRT2     = OFF
//      #pragma config WRT3     = OFF
        #pragma config WRTB     = OFF       // Boot Block Write Protection
        #pragma config WRTC     = OFF
//      #pragma config WRTD     = OFF
        #pragma config EBTR0    = OFF
        #pragma config EBTR1    = OFF
//      #pragma config EBTR2    = OFF
//      #pragma config EBTR3    = OFF
        #pragma config EBTRB    = OFF

/** I N C L U D E S **********************************************************/

#include "GenericTypeDefs.h"
#include "Compiler.h"
#include "usb_config.h"
#include "usb_device.h"
#include "usb.h"
#include "usb_function_cdc.h"
#include "BANDERA.h"
#include <delays.h>
//#include <p18f4550.h> // Always include the header file
#include <pic18f4550.h>




#include "HardwareProfile.h"


//#include <pic18f4550.h>

/** V A R I A B L E S ********************************************************/
//#if defined(__18CXX)
//    #pragma udata
//#endif

char USB_In_Buffer[64];
char USB_Out_Buffer[64];
//unsigned char Multiplex[20]={0x30};
unsigned char ValorADCH=0x00;
unsigned char ValorADCL=0x00;
unsigned char ValorPWM=0x00;

BOOL stringPrinted;
BOOL buttonPressed;
BYTE buttonCount;

/** P R I V A T E  P R O T O T Y P E S ***************************************/
void InitializeSystem(void);
void ProcessIO(void);
void USBDeviceTasks(void);
void USBCBSendResume(void);
void UserInit(void);
void T0Init(void);
void T1Init(void);
void EI0Init(void);
void ADCInit(void);


//void __attribute__((__interrupt__)) _INT0Interrupt(void);
//void __attribute__((__interrupt__)) _T0Interrupt(void);
//void __attribute__((__interrupt__)) _USBInterrupt(void);
//void __attribute__((__interrupt__)) InterruptServiceRutine(void);

//void YourHighPriorityISRCode();
//void YourLowPriorityISRCode();



/** USB CONFIGURATION  ***************************************/
//#define REMAPPED_RESET_VECTOR_ADDRESS			0x1000
//#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x1008
//#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS 	0x1018

/** INTERRUPTS ************************/
void __attribute__((interrupt, no_auto_psv)) MainISR(void){
    //USBDeviceTasks();

    if(INTCONbits.TMR0IF){//interrupcion timer 0
        T0CONbits.TMR0ON = 0;//disable timer 0
        INTCONbits.TMR0IE = 0;// Disable Timer0 interrupt (occurs on overflow)
        INTCONbits.TMR0IF = 0; // Clear interrupt Flag

        //se habilita bandera de envio usb
        ADCON0bits.GO_DONE=1;//start AD conversion
        while(ADCON0bits.GO_DONE |= 0);//loop until AD completes
        ValorADCH=ADRESH;
        ValorADCL=ADRESL;
        BAND0=1;

        INTCONbits.TMR0IE = 1; // Enable Timer0 interrupt (occurs on overflow)
        TMR0L = 0x00;   //re-initialise timer0 with FF
        TMR0H = 0x00;
        T0CONbits.TMR0ON = 1;   //enable timer
    }

    if(INTCONbits.INT0IF){
        INTCONbits.INT0IE=0;//disamble external interrupt
        INTCONbits.INT0IF=0;//clear interupt Flag

        //se reinciia timer 1

        INTCONbits.INT0IE=1;//disamble external interrupt
    }


	//Check which interrupt flag caused the interrupt.
	//Service the interrupt
	//Clear the interrupt flag
	//Etc.
	//This return will be a "retfie", since this is in a #pragma interruptlow section
}



/** DECLARATIONS ***************************************************/
//#if defined(__18CXX)
//    #pragma code
//#endif


void main(void)
{
    InitializeSystem();

    while(1)
    {
//        LATDbits.LATD0=0;
//        Delay10KTCYx(1000);

        //USBDeviceTasks(); //Takes care of enumeration and other USB events
        #if defined(USB_INTERRUPT)
            if(USB_BUS_SENSE && (USBGetDeviceState() == DETACHED_STATE))
            {
                USBDeviceAttach();
                LATDbits.LATD0=1;
            }
            if(USB_BUS_SENSE && (USBGetDeviceState() == ATTACHED_STATE))
            {
            LATDbits.LATD0=0;
            Delay10KTCYx(1000);
            LATDbits.LATD0=1;
            Delay10KTCYx(1000);
            }
        #endif
        //USBDeviceTasks();




        ProcessIO();

//        LATDbits.LATD0=1;
//        Delay10KTCYx(1000);
    }//end while


}//end main


void InitializeSystem(void)
{
    CMCON = 0x00; //'Turn off comparator
     //INTERRUPT SETTINGS
    RCONbits.IPEN = 1;
    //INTCONbits.GIEL = 1; // Enable low priority interrupts
    //////////////////////////////////////////////////////////////
    TRISDbits.RD0=0;

    //Incializa Banderas
    BAND0=0;//BANDERA de TIMER 0ADC

    /////////////////////////////////////////////////////////////
    UserInit();
    USBDeviceInit();	//usb_device.c.  Initializes USB module SFRs and firmware
    ADCInit();
    T0Init();//inicializa timer
    EI0Init();
    T1Init();//inicializa timer


 				//variables to known states.
}//end InitializeSystem


