pcorona182/Pic18F-and-C-/Monofasico.X/main.c
void ADCInit(void){
ADCON1=0b00001110;//Vcc,VDD ref AN0 analog only
ADCON0=0x00;//clear ADCON0 to select channel 0 AN0
ADCON2=0b00001000;//ADCON2 setup Tacq=2tad, tad=2*Tosc of fosc/2
ADCON0bits.ADON=0x01;//enable AD module
}


void EI0Init(void){

    INTCONbits.INT0IF=0;//clear interupt flag
    // configure external interrupt edge
    INTCON2bits.INTEDG0=1;
    //activa interrupcion externa
    INTCONbits.INT0E=1; // trigger on falling edge

}

void T0Init(void){
// Timer0 configuration
T0CONbits.TMR0ON = 0; // Stop the timer
T0CONbits.T08BIT = 0; // Run in 16-bit mode
T0CONbits.T0CS = 0; // Use system clock to increment timer
T0CONbits.PSA = 0; // A prescaler is assigned for Timer0
T0CONbits.T0PS2 = 1; // Use a 1:256 prescaler
T0CONbits.T0PS1 = 1;
T0CONbits.T0PS0 = 1;
TMR0L = 0x00;   //re-initialise timer0 with FF
TMR0H = 0x00;
INTCON2bits.TMR0IP= 0;	//TMR0 set to Low Priority Interrupt
INTCONbits.TMR0IE = 1; // Enable Timer0 interrupt (occurs on overflow)
INTCONbits.TMR0IF = 0; // Clear Timer0 interrupt flag
T0CONbits.TMR0ON = 1; // Start the timer
}


void T1Init(void){
// Timer1 configuration
T0CONbits.TMR0ON = 0; // Stop the timer
T0CONbits.T08BIT = 0; // Run in 16-bit mode
T0CONbits.T0CS = 0; // Use system clock to increment timer
T0CONbits.PSA = 0; // A prescaler is assigned for Timer0
T0CONbits.T0PS2 = 1; // Use a 1:256 prescaler
T0CONbits.T0PS1 = 1;
T0CONbits.T0PS0 = 1;
TMR0L = 0x00;   //re-initialise timer0 with FF
TMR0H = 0x00;
INTCON2bits.TMR0IP= 0;	//TMR0 set to Low Priority Interrupt
INTCONbits.TMR0IE = 1; // Enable Timer0 interrupt (occurs on overflow)
INTCONbits.TMR0IF = 0; // Clear Timer0 interrupt flag
T0CONbits.TMR0ON = 1; // Start the timer
}


void UserInit(void)
{
    //Initialize all of the debouncing variables
    buttonCount = 0;
    buttonPressed = FALSE;
    stringPrinted = TRUE;

}//end UserInit






/********************************************************************
 * Function:        void ProcessIO(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is a place holder for other user
 *                  routines. It is a mixture of both USB and
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void ProcessIO(void)
{
    BYTE numBytesRead;

    //Blink the LEDs according to the USB device status
    //BlinkUSBStatus();
    // User Application USB tasks
    if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return;
    if(BAND0==1){
        if(stringPrinted == FALSE){
            if(mUSBUSARTIsTxTrfReady()){
                putsUSBUSART(ValorADCH);
                putsUSBUSART(ValorADCL);
                stringPrinted=TRUE;
            }
        }
        BAND0=0;
    }

    else
    {
        stringPrinted = FALSE;
    }

    if(USBUSARTIsTxTrfReady())
    {
		numBytesRead = getsUSBUSART(USB_Out_Buffer,64);
		if(numBytesRead != 0)
		{
			BYTE i;

			for(i=0;i<numBytesRead;i++)
			{
				switch(USB_Out_Buffer[i])
				{
					case 0x0A:
                                            //LATAbits.LATA1=!LATAbits.LATA1;
                                            break;
					case 0x0D:
						//USB_In_Buffer[i] = USB_Out_Buffer[i];
						break;
					default:
						//USB_In_Buffer[i] = USB_Out_Buffer[i] + 1;
						break;
				}

			}

			//putUSBUSART(USB_In_Buffer,numBytesRead);
		}
	}

    CDCTxService();
}		//end ProcessIO

// ******************************************************************************************************
// ************** USB Callback Functions ****************************************************************
// ******************************************************************************************************
// The USB firmware stack will call the callback functions USBCBxxx() in response to certain USB related
// events.  For example, if the host PC is powering down, it will stop sending out Start of Frame (SOF)
// packets to your device.  In response to this, all USB devices are supposed to decrease their power
// consumption from the USB Vbus to <2.5mA* each.  The USB module detects this condition (which according
// to the USB specifications is 3+ms of no bus activity/SOF packets) and then calls the USBCBSuspend()
// function.  You should modify these callback functions to take appropriate actions for each of these
// conditions.  For example, in the USBCBSuspend(), you may wish to add code that will decrease power
// consumption from Vbus to <2.5mA (such as by clock switching, turning off LEDs, putting the
// microcontroller to sleep, etc.).  Then, in the USBCBWakeFromSuspend() function, you may then wish to
// add code that undoes the power saving things done in the USBCBSuspend() function.

// The USBCBSendResume() function is special, in that the USB stack will not automatically call this
// function.  This function is meant to be called from the application firmware instead.  See the
// additional comments near the function.

// Note *: The "usb_20.pdf" specs indicate 500uA or 2.5mA, depending upon device classification. However,
// the USB-IF has officially issued an ECN (engineering change notice) changing this to 2.5mA for all
// devices.  Make sure to re-download the latest specifications to get all of the newest ECNs.

/******************************************************************************
 * Function:        void USBCBSuspend(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Call back that is invoked when a USB suspend is detected
 *
 * Note:            None
 *****************************************************************************/
void USBCBSuspend(void)
{
	//Example power saving code.  Insert appropriate code here for the desired
	//application behavior.  If the microcontroller will be put to sleep, a
	//process similar to that shown below may be used:

	//ConfigureIOPinsForLowPower();
	//SaveStateOfAllInterruptEnableBits();
	//DisableAllInterruptEnableBits();
	//EnableOnlyTheInterruptsWhichWillBeUsedToWakeTheMicro();	//should enable at least USBActivityIF as a wake source
	//Sleep();
	//RestoreStateOfAllPreviouslySavedInterruptEnableBits();	//Preferrably, this should be done in the USBCBWakeFromSuspend() function instead.
	//RestoreIOPinsToNormal();									//Preferrably, this should be done in the USBCBWakeFromSuspend() function instead.

	//IMPORTANT NOTE: Do not clear the USBActivityIF (ACTVIF) bit here.  This bit is
	//cleared inside the usb_device.c file.  Clearing USBActivityIF here will cause
	//things to not work as intended.


    #if defined(__C30__) || defined __XC16__
        USBSleepOnSuspend();
    #endif
}

